public/sysbench-tidesql-v4-5-6-innodb-mariadb-v11-8-6-tidesdb-v9.3.6/innodb_oltp_insert_run3.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 4595.58 qps: 4595.58 (r/w/o: 0.00/4595.58/0.00) lat (ms,95%): 10.65 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 3864.61 qps: 3864.61 (r/w/o: 0.00/3864.61/0.00) lat (ms,95%): 11.04 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 3508.09 qps: 3508.09 (r/w/o: 0.00/3508.09/0.00) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 3375.80 qps: 3375.80 (r/w/o: 0.00/3375.80/0.00) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 4673.89 qps: 4673.89 (r/w/o: 0.00/4673.89/0.00) lat (ms,95%): 10.27 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 2422.51 qps: 2422.51 (r/w/o: 0.00/2422.51/0.00) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 4415.59 qps: 4415.59 (r/w/o: 0.00/4415.59/0.00) lat (ms,95%): 10.84 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 2760.31 qps: 2760.31 (r/w/o: 0.00/2760.31/0.00) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 4553.50 qps: 4553.50 (r/w/o: 0.00/4553.50/0.00) lat (ms,95%): 10.46 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 2620.10 qps: 2620.10 (r/w/o: 0.00/2620.10/0.00) lat (ms,95%): 17.01 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 4801.79 qps: 4801.79 (r/w/o: 0.00/4801.79/0.00) lat (ms,95%): 11.04 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 2471.09 qps: 2471.09 (r/w/o: 0.00/2471.09/0.00) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           440649
        other:                           0
        total:                           440649
    transactions:                        440649 (3671.68 per sec.)
    queries:                             440649 (3671.68 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      3671.6752
    time elapsed:                        120.0131s
    total number of events:              440649

Latency (ms):
         min:                                    0.03
         avg:                                    4.36
         max:                                  961.39
         95th percentile:                       12.52
         sum:                              1919439.26

Threads fairness:
    events (avg/stddev):           27540.5625/113.26
    execution time (avg/stddev):   119.9650/0.00